pets={}
a = input("Имя питомца  ")
pets[a] = {"Вид питомца" : input("Вид питомца   "), "Возраст питомца" : int(input("Возраст питомца  ")), "Имя владельца" : input("Имя владельца ")}
if (pets[a]["Возраст питомца"]%10 == 1):
    d = "год"
elif (pets[a]["Возраст питомца"]%10>1 and pets[a]["Возраст питомца"]%10<5):
    d = "года"
else:
    d = "лет"
print("Это", list(pets[a].values())[0], "по кличке", list(pets.keys())[0],". Возраст питомца:", list(pets[a].values())[1], d, ". Имя владельца", list(pets[a].values())[2])